{
  "contact_info": {
    "first_name": "John",
    "middle_name": "Macklin",
    "last_name": "Pridmore",
    "phone_number": "847-471-4073",
    "contact": [
      {
        "description": "Email",
        "link": "mailto:johnpridmore.lit@gmail.com",
        "img_ref": "../assets/GmailLogo.webp"
      },
      {
        "description": "LinkedIn",
        "link": "https://LinkedIn.com/in/JPrid",
        "img_ref": "../assets/LI-In-Bug.webp"
      },
      {
        "description": "Github",
        "link": "https://www.github.com/JPrid",
        "img_ref": "../assets/GitHub-Mark-120px-plus.webp"
      }
    ]
  },
  "experience": [
    {
      "company": "Galileo Insights LLC",
      "title":  "Software Engineering Consultant",
      "start": "October 2021",
      "end": "now",
      "img_reference": "../../assets/logo-small-transparent.png",
      "url": "https://galileoinsights.space",
      "summary": "",
      "tags": ["C#", "Typescript", "Angular", "Twilio", ".NETCore", "GCP"],
      "experience_content": [
        "Added a new docker image to include unit testing in the client company's Azure Devops pipeline. This would serve as Proof Of Concept for adding testing to the build pipeline of other projects.",
        "Implemented screensharing in client's telemedicine platform via Twilio",
        "Implemented virtual backgrounds in client's telemedicine platform via Twilio and settings page to allow end users to select virtual backgrounds",
        "Re-organized the video layout used by client's telemedicine platform",
        "Developed a live network quality monitor for phone and video calls for client's telemedicine platform",
        "Updated telemedicine application to display participant information for client's telemedicine platform",
        "Implemented a multi-step scheduling form to allow patients to schedule appointments 24 hours in advance for client's telemedicine platform",
        "Implemented email sending service for aforementioned scheduling service for client's telemedicine platform",
        "Defined a View to collate information regarding interpreters for administration for client's telemedicine platform",
        "Implemented password reset API for mobile client apps to integrate with each other for client's telemedicine platform",
        "Consulted on SSO architecting to move client apps away from Wordpress Identity Integration for client's telemedicine platform"
      ]
    },
    {
      "company": "Relativity",
      "title": "Advanced Software Engineer",
      "start": "March 2020",
      "end": "October 2021",
      "img_reference": "../../assets/relativity-logo-white.webp",
      "url": "https://www.relativity.com/",
      "summary": "",
      "tags": ["C#", "C++/CLI", "MS-SQL", "Powershell", "Jenkins", "Python", "Azure", ".NET", "Groovy"],
      "experience_content": [
        "Implemented Tenant-wide resource locking for Load jobs.",
        "Implemented Locale retrieval and configuration on Azure VM on tenant assignment.",
        "Integrated Azure Event Hub into multi-tenant worker code to produce events on job completion.",
        "Decoupling custom metadata binding APIs from worker logic and making them tenant-agnostic.",
        "Moved infrastructure components into shared libraries and refactoring to use Azure Key Vault for secret management."
      ]
    },
    {
      "company": "Relativity",
      "title": "Software Engineer",
      "start": "August 2018",
      "end": "March 2020",
      "img_reference": "../../assets/relativity-logo-white.webp",
      "url": "https://www.relativity.com/",
      "summary": "",
      "tags": [],
      "experience_content": [
        "Implemented the ability to remove documents from review, and re-calculate de-duplication for affected data sources.",
        "Designed, delivered, and Implemented a feature that enables clients to re-run the ETL pipeline. This allows them to process documents with updated settings, allowing for the extraction of new metadata, and easing a common client pain point.",
        "Updated the functional test framework to be environment-aware: testing environments now clean up debug-resources that could cause noisy neighbor issues and/or potentially prevent full/accurate coverage of the codebase.",
        "Achieved level 1 Support status due to my knowledge of Relativity Processing spanning the breadth of the ETL process.",
        "Eliminated duplicate code paths, in the functional tests covering the Load step, by a factor of 4.",
        "Eliminated ~50 hours of manual maintenance by Implementing a disposable pattern for databases to ensure they are cleaned up on functional test teardown.",
        "Reduced flaky tests caused by noisy neighbor issues by implementing phases for functional test jobs.",
        "Increased transparency into the processing engine by allowing users to see all of the files run through the engine. Furthermore, in order to allow clients to more easily visualize the data coming back, grouping, and pivoting on properties was introduced.",
        "Enabled greater ease of disaster recovery by moving various automation assets into source code management. Furthermore, I removed the need for manual work required when switching branches under test. This was achieved by consolidating the seeding and DSL logic into generic, config driven pipelines. One Pull Request is all that is required now to transition branches, whereas previously developers would modify the configuration of 4 jobs on the Jenkins server's UI.",
        "Mentored an Intern through multiple projects: refactoring functional tests to be more economical in their use of database assets; developing a script to refactor tests; and implementing a jenkins job to trigger an upgrade of the processing engine and, if needed, the Relativity platform as well. Previously all of the standard Relativity Applications had to be updated."
      ]
    },
    {
      "company": "rMark Bio, LLC (now within3)",
      "title": "Software Engineer Intern",
      "start": "January 2017",
      "end": "May 2017",
      "url": "https://rmarkbio.com",
      "img_reference": "../../assets/rmarkbio.jpg",
      "tags": ["Python", "Google Cloud Platform", "REST APIs"],
      "summary": "",
      "experience_content": [
        "Built publish / subscription system to allow clients to subscribe to new pharmaceutical publications",
        "Used RESTful APIs to send and receive messages using google cloud's publication/subscription modules and documented and tested accordingly.",
        "Formatted production server to take appropriate HTTP calls via NGINX configuration",
        "Developed individualized Pub / Sub connections to pipeline specific data to users."
      ]
    }
  ],
  "organizations": [
    {
      "name": "DePaul Computer Science Society",
      "start_date": "2017",
      "end_date": "2018",
      "role": "Vice President",
      "data": [
        "Planned and ran the DemonHacks Hackathon in its inaugural year",
        "Organized, Planned, and ran meetings in addition to; coordinating company visits"
      ]
    }
  ]
}
